Revit 2027 API
ImagePlacementOptions Constructor
Overload List
Name | Description
ImagePlacementOptions() |  Constructs a new ImagePlacementOptions that will place an ImageInstance with its center at the origin of the model
ImagePlacementOptions(XYZ, BoxPlacement) |  Constructs a new ImagePlacementOptions for placing an ImageInstance
Top
See Also
Reference
ImagePlacementOptions Class
Autodesk.Revit.DB Namespace